Documents/КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВП_ВидыОперацийРегистрацииПоМестуЖительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КВП_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проживающий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УПЖКХ_Жильцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УПЖКХ_Жильцы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УдалитьРодственники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родственник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УПЖКХ_Жильцы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтепеньРодства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/КВП_ВидыОперацийРегистрацииПоМестуЖительства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>КВП_ВидыОперацийРегистрацииПоМестуЖительства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеСРегистрации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/УПЖКХ_Жильцы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УПЖКХ_Жильцы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КВП_ЛицевыеСчета</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПенсионноеУдостоверениеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПенсионноеУдостоверениеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПенсионноеУдостоверениеСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПенсионноеУдостоверениеКемВыдано</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СведенияОСобственностиПеренесены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегистрацияПраваСобственностиНомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтраховойНомерПФР</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРегистрацияПраваСобственностиДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДействуетС</Name>
							<Comment>Используется как дата прибытия или выбытия в контактной информации жильца.</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/КВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительства/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура формирует и устанавливает текст заголовка формы документа.
//
&НаСервере
Процедура УстановитьЗаголовокФормыДокумента()
	
	УПЖКХ_РаботаСДиалогамиКлиентСервер.УстановитьЗаголовокФормыДокумента(Строка(Объект.ВидОперации),
																			Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

// Процедура устанавливает подменю "Печать" и кнопку "Печать по умолчанию" при необходимости.
//
&НаКлиенте
Процедура УстановитьКнопкиПечати()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация") Тогда
		Показать = Истина;
	Иначе		
		Показать = Ложь;
	КонецЕсли;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументКВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительстваПечатьФ2.Видимость = Показать;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументКВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительстваПечатьС_ПР.Видимость = Показать;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументКВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительстваПечатьС_ЗП.Видимость = Показать;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументКВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительстваПечатьЗ_С.Видимость = Показать;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументКВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительстваПечатьРФЛ1.Видимость = Показать;
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаПечать.ПодчиненныеЭлементы.ФормаДокументКВП_ЗаявлениеОРегистрацииОСнятииСРегистрационногоУчетаПоМестуЖительстваПечатьФ7.Видимость = Не Показать;
	
КонецПроцедуры

// Возвращает массив собственников по лицевому счету.
&НаСервере
Функция ПолучитьМассивСобственников()
	
	ТаблицаСобственников = ПолучитьДанныеОСобственностиПомещения(Объект.ЛицевойСчет.Адрес, Объект.Дата);
	
	Возврат ТаблицаСобственников.ВыгрузитьКолонку("Собственник");
	
КонецФункции

// Процедура устанавливает адрес жильца для просмотра и редактирования из реквизита Проживающий.
//
&НаСервере
Процедура УстановитьЗначениеАдресаИзСсылкиНаПроживающего()
	
	Если ЗначениеЗаполнено(Объект.Проживающий) Тогда
		Элементы.АдресЖильца.Видимость = Истина;
		
		ДопПараметры = Новый Структура("ТолькоПервая", Истина);
		
		Если Объект.ВидОперации = Перечисления.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация Тогда
			Элементы.АдресЖильца.Заголовок = "Адрес прибытия";
			АдресЖильца = УПЖКХ_ТиповыеМетодыСервер.КонтактнаяИнформацияПредставлениеКонтактнойИнформацииОбъекта(Объект.Проживающий, Справочники.ВидыКонтактнойИнформации.УПЖКХ_АдресПрибытияЖильца,,Объект.Дата, ДопПараметры);
		Иначе
			Элементы.АдресЖильца.Заголовок = "Адрес выбытия";
			АдресЖильца = УПЖКХ_ТиповыеМетодыСервер.КонтактнаяИнформацияПредставлениеКонтактнойИнформацииОбъекта(Объект.Проживающий, Справочники.ВидыКонтактнойИнформации.УПЖКХ_АдресВыбытияЖильца,,Объект.Дата, ДопПараметры);
		КонецЕсли;
		
		Если ПустаяСтрока(АдресЖильца) Тогда
			АдресЖильца = УПЖКХ_ТиповыеМетодыКлиентСервер.КонтактнаяИнформацияТекстПустогоАдресаВВидеГиперссылки();
		КонецЕсли;
		
	Иначе
		Элементы.АдресЖильца.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает адрес жильца из структуры с адресами.
//
&НаКлиенте
Процедура УстановитьЗначениеАдресаИзСтруктуры(СтруктураСАдресами)
	
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация") Тогда
			АдресЖильца = СтруктураСАдресами.АдресПрибытия;
		Иначе
			АдресЖильца = СтруктураСАдресами.АдресВыбытия;
		КонецЕсли;
		
	КонецПроцедуры

// Процедура открыват форму редактирования адреса жильца.
//
&НаКлиенте
Процедура ОткрытьОкноРедактированияАдресаЖильца()
	
	Если Не ЗначениеЗаполнено(Объект.Проживающий) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Ключ", Объект.Проживающий);
	ФормаЖильца = ПолучитьФорму("Справочник.УПЖКХ_Жильцы.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);
	ИдентификаторФормыЖильца = ФормаЖильца.УникальныйИдентификатор;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.КВП_ВидыОперацийРегистрацииПоМестуЖительства.Регистрация") Тогда
		УПЖКХ_ТиповыеМетодыКлиент.КонтактнаяИнформацияНачалоВыбора(ФормаЖильца, ФормаЖильца.Элементы.КонтактнаяИнформацияПолеУПЖКХ_АдресПрибытияЖильца,, Истина);
	Иначе
		УПЖКХ_ТиповыеМетодыКлиент.КонтактнаяИнформацияНачалоВыбора(ФормаЖильца, ФормаЖильца.Элементы.КонтактнаяИнформацияПолеУПЖКХ_АдресВыбытияЖильца,, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриЧтенииНаСервере" формы.
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УПЖКХ_ТиповыеМетодыСервер.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
КонецПроцедуры

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	УПЖКХ_ТиповыеМетодыСервер.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Устанавливаем значение по умолчанию.
	Если Объект.Ссылка.Пустая() Тогда
		УПЖКХ_ЗаполнениеДокументовСервер.ЗаполнитьШапкуДокумента(Объект,
																	УПЖКХ_ТиповыеМетодыКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	// Вывести в заголовке формы вид операции.
	УстановитьЗаголовокФормыДокумента();
	
	УстановитьЗначениеАдресаИзСсылкиНаПроживающего();
	
	// Установить доступность формы с учетом ключа СЛК.
	СЗК_МодульЗащитыКлиентСервер.УстановитьДоступностьФормыДляРедактирования(ЭтаФорма);
	
	// ОбщиеМеханизмыИКоманды
	ОТР_ПодключаемыеОбщиеМеханизмыИКоманды.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ОбщиеМеханизмыИКоманды
	
КонецПроцедуры

// Процедура - обработчик события "ПриОткрытии" формы.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Установка кнопок печати
	УстановитьКнопкиПечати();
	
КонецПроцедуры

// Процедура - обработчик события "ПослеЗаписиНаСервере" формы.
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

// Процедура - обработчик оповещения.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтактнаяИнформацияПредставлениеНачалоВыбораЗавершение" Тогда
		
		Если ТипЗнч(Параметр) = Тип("УправляемаяФорма")
			 И Параметр.УникальныйИдентификатор = ИдентификаторФормыЖильца
			 И Параметр.Модифицированность Тогда
				Параметр.Записать();
				ИдентификаторФормыЖильца = Неопределено;
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ЗаписанЭлементСправочникаУПЖКХ_Жильцы" И Параметр.Ссылка = Объект.Проживающий Тогда
		
		//Обновить представление адресов
		УстановитьЗначениеАдресаИзСтруктуры(Параметр);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

#Область ОбработчикиСобытийЭлементовФормы

// Процедура - обработчик события "ПриИзменении" поля ввода даты документа.
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	УПЖКХ_РаботаСДиалогамиКлиентСервер.ПроверитьНомерДокумента(Объект, Объект.Дата);
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода проживающего.
&НаКлиенте
Процедура ПроживающийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Не Объект.ЛицевойСчет.Пустая() Тогда
		СтандартнаяОбработка = Ложь;
		
		ОткрытьФорму("Справочник.УПЖКХ_Жильцы.Форма.ФормаВыбора", Новый Структура("ЛицевойСчет", Объект.ЛицевойСчет), Элемент);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода проживающего.
&НаКлиенте
Процедура ПроживающийПриИзменении(Элемент)
	
	Объект.ЛицевойСчет = УПЖКХ_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Проживающий, "Владелец");
	
	Если Не УПЖКХ_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Собственник, "Владелец") = Объект.ЛицевойСчет Тогда
		Объект.Собственник = ПредопределенноеЗначение("Справочник.УПЖКХ_Жильцы.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьЗначениеАдресаИзСсылкиНаПроживающего();
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода Лицевой счет.
&НаКлиенте
Процедура ЛицевойСчетПриИзменении(Элемент)
	
	Если УПЖКХ_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Проживающий, "Владелец") <> Объект.ЛицевойСчет Тогда
		Объект.Проживающий = ПредопределенноеЗначение("Справочник.УПЖКХ_Жильцы.ПустаяСсылка");
	КонецЕсли;
	
	УстановитьЗначениеАдресаИзСсылкиНаПроживающего();
	
	Если Не УПЖКХ_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(Объект.Собственник, "Владелец") = Объект.ЛицевойСчет Тогда
		Объект.Собственник = ПредопределенноеЗначение("Справочник.УПЖКХ_Жильцы.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ПриИзменении" поля ввода ВидОперации.
&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	УстановитьКнопкиПечати();
	
	УстановитьЗначениеАдресаИзСсылкиНаПроживающего();
	
КонецПроцедуры

// Процедура - обработчик события "НачалоВыбора" поля ввода Собственник.
&НаКлиенте
Процедура СобственникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	МассивПараметров = Новый Массив();
	
	МассивСобственников = ПолучитьМассивСобственников();
	
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ФизЛицо",  МассивСобственников));
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Объект.ЛицевойСчет));
	
	НовыеПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
	Элемент.ПараметрыВыбора = НовыеПараметрыВыбора;
	
КонецПроцедуры

// Процедура - обработчик события "Очистка" поля ввода ВидОперации.
&НаКлиенте
Процедура ВидОперацииОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

// Процедура - обработчик события "Нажатие" гиперссылки адреса.
&НаКлиенте
Процедура АдресЖильцаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьОкноРедактированияАдресаЖильца();
КонецПроцедуры

#КонецОбласти

//////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	УПЖКХ_ТиповыеМетодыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	УПЖКХ_ТиповыеМетодыСервер.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	УПЖКХ_ТиповыеМетодыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ЧастоЗадаваемыеВопросы
&НаКлиенте
// Подключаемый обработчик команды перехода к часто задаваемым вопросам.
Процедура Подключаемый_ЧастоЗадаваемыеВопросыОткрытьСсылку(Команда)
	
	ОТР_ЧастоЗадаваемыеВопросыКлиент.Подключаемый_ЧастоЗадаваемыеВопросыОткрытьСсылку(Команда);
	
КонецПроцедуры
// Конец ЧастоЗадаваемыеВопросы

#КонецОбласти
